In [1]:
import pandas as pd

### make a Pandas Dataframe with Two dimensional list

In [2]:
list=[[1,2],[3,4]]
df= pd.DataFrame(list, columns=("list 1","list 2"))
df

   list 1  list 2
0       1       2
1       3       4

### Creating DataFrame from dict of narray/lists

In [3]:
data={
    "Hello": [1,2,3,4],
    "World": [5,6,7,8],
}
df= pd.DataFrame(data, index=['hey','hii','bye','good'])
print(df)
df.transpose()

      Hello  World
hey       1      5
hii       2      6
bye       3      7
good      4      8

       hey  hii  bye  good
Hello    1    2    3     4
World    5    6    7     8

### Creating a Pandas dataframe using list of tuples

In [4]:
data=[("Audi",25,2),("Dodge",30,1),("BMW",28,3)]
df= pd.DataFrame(data, columns=["Cars","Milage","Position"])
print(df)
a=df.pivot(index="Cars", columns="Milage", values="Position")
a

    Cars  Milage  Position
0   Audi      25         2
1  Dodge      30         1
2    BMW      28         3

Milage   25   28   30
Cars
Audi    2.0  NaN  NaN
BMW     NaN  3.0  NaN
Dodge   NaN  NaN  1.0

###  Convert List of Dictionaries to a Pandas DataFrame Using pd.DataFrame.from_dict()

In [5]:
data=[
    {"My":"name",
    "Mine":"Age",
    "I":"Am",},
    {"My":"Nitin",
      "Mine":"19",
      "I":"engineer",
    }
    
]
df= pd.json_normalize(data)
df

      My Mine         I
0   name  Age        Am
1  Nitin   19  engineer

### covert list  nested dictionary into pandas dataframe

In [6]:
countries = {
    "1": {"Country": "India",
          "Capital": "Delhi",
          "Population": "141.72 crores"},
    "2": {"Country": "Japan",
          "Capital": "Tokyo",
          "Population": "12.51 crores "},
    "3": {"Country": "USA",
          "Capital": "Washington, D.C.",
          "Population": "33.33 crores"}
}
df= pd.DataFrame.from_dict(countries, orient="index")
df

  Country           Capital     Population
1   India             Delhi  141.72 crores
2   Japan             Tokyo  12.51 crores
3     USA  Washington, D.C.   33.33 crores

### Pandas dataframe using regex

In [7]:
df

  Country           Capital     Population
1   India             Delhi  141.72 crores
2   Japan             Tokyo  12.51 crores
3     USA  Washington, D.C.   33.33 crores

In [8]:
df.replace(to_replace="USA", value="U.S.A", regex=True)

  Country           Capital     Population
1   India             Delhi  141.72 crores
2   Japan             Tokyo  12.51 crores
3   U.S.A  Washington, D.C.   33.33 crores

### Creating a dataframe from Pandas series

In [9]:
A= ["Apple","Red","Banana","yellow","grapes","green"]
B= [11,22,33,44,55,66]
df1=pd.Series(A)
df2=pd.Series(B)

Auth={
    'A':df1,
    'B':df2
}
c= pd.DataFrame(Auth)
c

        A   B
0   Apple  11
1     Red  22
2  Banana  33
3  yellow  44
4  grapes  55
5   green  66

### Create pandas dataframe from string using pandas read_clipboard()

In [10]:
df = pd.read_clipboard(sep=";")
df

Empty DataFrame
Columns: [Reindexing in Pandas DataFrame]
Index: []

### Clean the string data in the given Pandas Dataframe

### Reindexing in Pandas DataFrame

In [11]:
import numpy as np

In [15]:
column=["A","B","C","D","E"]
rows=["a","b","c","d","e"]
data= pd.DataFrame(np.random.rand(5,5), columns=column, index=rows)
print(data)
print("\n Reidex values")
print(data.reindex(["e","d","c","b","a"]))

          A         B         C         D         E
a  0.577308  0.476711  0.734871  0.262299  0.169644
b  0.133774  0.680889  0.267863  0.587748  0.690347
c  0.078619  0.110382  0.724008  0.681211  0.787025
d  0.247265  0.559592  0.757905  0.635286  0.955729
e  0.594685  0.895949  0.064185  0.833945  0.794144

 Reidex values
          A         B         C         D         E
e  0.594685  0.895949  0.064185  0.833945  0.794144
d  0.247265  0.559592  0.757905  0.635286  0.955729
c  0.078619  0.110382  0.724008  0.681211  0.787025
b  0.133774  0.680889  0.267863  0.587748  0.690347
a  0.577308  0.476711  0.734871  0.262299  0.169644

### Mapping external values to dataframe values in Pandas

In [27]:
data={'first_name':["Nitin","Amrit","Pawan","Akash","Randeep"],
     'last_name': ["Rana","Singh","Singh","kumar","Singh"],
      'Age': [19,20,20,21,22]
     }
df= pd.DataFrame(data, columns=['first_name','last_name','Age'])
print(df)
Ndata={
    'Nitin': "B.tech",
    'Amrit': "MBBS",
    'Pawan': "BBA",
    'Akash': "B pharmacy",
    "Randeep": "Agriculture"
}

df["Qualification"]=df["first_name"].map(Ndata)
print(df)

D1={
    'Akash': "A",
    'Randeep':'R'
}
df1=df.replace({"first_name":D1})
df1

  first_name last_name  Age
0      Nitin      Rana   19
1      Amrit     Singh   20
2      Pawan     Singh   20
3      Akash     kumar   21
4    Randeep     Singh   22
  first_name last_name  Age Qualification
0      Nitin      Rana   19        B.tech
1      Amrit     Singh   20          MBBS
2      Pawan     Singh   20           BBA
3      Akash     kumar   21    B pharmacy
4    Randeep     Singh   22   Agriculture

  first_name last_name  Age Qualification
0      Nitin      Rana   19        B.tech
1      Amrit     Singh   20          MBBS
2      Pawan     Singh   20           BBA
3          A     kumar   21    B pharmacy
4          R     Singh   22   Agriculture

### Adding CSv file in Pandas dataframes

In [30]:
df= pd.read_csv("https://media.geeksforgeeks.org/wp-content/uploads/nba.csv")
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

### Renaming Columns And rows in dataframes

In [37]:
df=pd.DataFrame({
    "Name": ["Nitin", "Amrit", "pawan"],
    "Age": [19,20,21]
})
print(df)

df.columns=["Col1","Col2"]
df.index=["R1","R2","R3"]
df

    Name  Age
0  Nitin   19
1  Amrit   20
2  pawan   21

     Col1  Col2
R1  Nitin    19
R2  Amrit    20
R3  pawan    21